app/views/project/list.html.haml

		= link_to({:action =>'show', :id => e.id }, :class => 'image') do
			- e.images.each do |image|
---
SELECT `images`.* FROM `images` WHERE `images`.`project_id` = 1