app/views/project/show.html.haml

SELECT `images`.* FROM `images` WHERE `images`.`project_id` = 1
---
	%h1  #{@project.name}
	- @project.images.each do |e|