app/controllers/project_controller.rb

  def list
  	@projects= Project.all.sorted
---
SELECT `projects`.* FROM `projects` ORDER BY `projects`.`id` ASC

  def show
  	@project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE (projects.id > 'id') ORDER BY `projects`.`id` DESC LIMIT 1